
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВыборкаРаспределения = РаспределенныйДневнойПлан();
	
	Движения.ПланыПереводов.Записывать = Истина;
	
	Пока ВыборкаРаспределения.Следующий() Цикл
		Движение = Движения.ПланыПереводов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаРаспределения);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РаспределенныйДневнойПлан()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикРаботы.Период КАК Период
		|ПОМЕСТИТЬ РабочиеДни
		|ИЗ
		|	РегистрСведений.ГрафикРаботы КАК ГрафикРаботы
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ГрафикРаботы.Период, МЕСЯЦ) = &Период
		|	И ГрафикРаботы.РабочийДень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПланПереводовСотрудники.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	РабочиеДни.Период КАК ПериодПлана,
		|	ПланПереводовСотрудники.Пользователь КАК Пользователь,
		|	ПланПереводовСотрудники.Произведение КАК Произведение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВсегоДней.Количество, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ПланПереводовСотрудники.План / ВсегоДней.Количество
		|	КОНЕЦ КАК План
		|ИЗ
		|	Документ.ПланПереводов.Сотрудники КАК ПланПереводовСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РабочиеДни КАК РабочиеДни
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочиеДни.Период) КАК Количество
		|		ИЗ
		|			РабочиеДни КАК РабочиеДни) КАК ВсегоДней
		|		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка
	
КонецФункции

#КонецОбласти

