
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ЗаполнитьГрафикНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикНаСервере()

	ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	ДатаОкончания = КонецГода(ДатаНачала);
	
	Пока ДатаНачала < ДатаОкончания Цикл
		
		ЭтоВыходной = ДеньНедели(ДатаНачала) = 6 Или ДеньНедели(ДатаНачала) = 7;
		
		Запись = РегистрыСведений.ГрафикРаботы.СоздатьМенеджерЗаписи();
		Запись.Период = ДатаНачала;
		Запись.РабочийДень = Не ЭтоВыходной;
		Запись.Записать();
		
		ДатаНачала = КонецДня(ДатаНачала) + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


